export type IRegionLocation = {
  id: number;
  name: string;
  coordinates: [number, number];
};

export const regionLocations: IRegionLocation[] = [
  {
    id: 1,
    name: "Москва",
    coordinates: [55.7558, 37.6173],
  },
  {
    id: 2,
    name: "Санкт-Петербург",
    coordinates: [59.9343, 30.3351],
  },
  {
    id: 3,
    name: "Севастополь",
    coordinates: [44.6166, 33.5254],
  },
  {
    id: 4,
    name: "Республика Адыгея",
    coordinates: [44.6078, 40.1058],
  },
  {
    id: 5,
    name: "Республика Алтай",
    coordinates: [51.9582, 85.9602],
  },
  {
    id: 6,
    name: "Республика Башкортостан",
    coordinates: [54.7349, 55.9578],
  },
  {
    id: 7,
    name: "Республика Бурятия",
    coordinates: [51.8334, 107.5841],
  },
  {
    id: 8,
    name: "Республика Дагестан",
    coordinates: [42.9849, 47.5047],
  },
  {
    id: 9,
    name: "Донецкая Народная Республика",
    coordinates: [48.0159, 37.8029],
  },
  {
    id: 10,
    name: "Республика Ингушетия",
    coordinates: [43.1667, 44.8167],
  },
  {
    id: 11,
    name: "Кабардино-Балкарская Республика",
    coordinates: [43.4846, 43.6029],
  },
  {
    id: 12,
    name: "Республика Калмыкия",
    coordinates: [46.3078, 44.2558],
  },
  {
    id: 13,
    name: "Карачаево-Черкесская Республика",
    coordinates: [43.9133, 41.9173],
  },
  {
    id: 14,
    name: "Республика Карелия",
    coordinates: [61.7849, 34.3469],
  },
  {
    id: 15,
    name: "Республика Коми",
    coordinates: [61.6688, 50.8366],
  },
  {
    id: 16,
    name: "Республика Крым",
    coordinates: [45.0333, 34.1],
  },
  {
    id: 17,
    name: "Луганская Народная Республика",
    coordinates: [48.5671, 39.3171],
  },
  {
    id: 18,
    name: "Республика Марий Эл",
    coordinates: [56.6345, 47.8742],
  },
  {
    id: 19,
    name: "Республика Мордовия",
    coordinates: [54.1838, 45.1749],
  },
  {
    id: 20,
    name: "Республика Саха (Якутия)",
    coordinates: [62.0339, 129.7331],
  },
  {
    id: 21,
    name: "Республика Северная Осетия — Алания",
    coordinates: [43.0367, 44.6678],
  },
  {
    id: 22,
    name: "Республика Татарстан",
    coordinates: [55.7887, 49.1221],
  },
  {
    id: 23,
    name: "Республика Тыва",
    coordinates: [51.7194, 94.4377],
  },
  {
    id: 24,
    name: "Удмуртская Республика",
    coordinates: [56.8498, 53.2045],
  },
  {
    id: 25,
    name: "Республика Хакасия",
    coordinates: [53.7156, 91.4292],
  },
  {
    id: 26,
    name: "Чеченская Республика",
    coordinates: [43.3179, 45.6987],
  },
  {
    id: 27,
    name: "Чувашская Республика",
    coordinates: [56.1322, 47.2519],
  },
  {
    id: 28,
    name: "Алтайский край",
    coordinates: [53.3548, 83.7698],
  },
  {
    id: 29,
    name: "Забайкальский край",
    coordinates: [52.034, 113.501],
  },
  {
    id: 30,
    name: "Камчатский край",
    coordinates: [53.0234, 158.6478],
  },
  {
    id: 31,
    name: "Краснодарский край",
    coordinates: [45.0355, 38.9753],
  },
  {
    id: 32,
    name: "Красноярский край",
    coordinates: [56.009, 92.8719],
  },
  {
    id: 33,
    name: "Пермский край",
    coordinates: [58.0105, 56.2502],
  },
  {
    id: 34,
    name: "Приморский край",
    coordinates: [43.1332, 131.9113],
  },
  {
    id: 35,
    name: "Ставропольский край",
    coordinates: [45.0428, 41.9734],
  },
  {
    id: 36,
    name: "Хабаровский край",
    coordinates: [48.4827, 135.0846],
  },
  {
    id: 37,
    name: "Амурская область",
    coordinates: [50.2785, 127.5391],
  },
  {
    id: 38,
    name: "Архангельская область",
    coordinates: [64.5401, 40.5433],
  },
  {
    id: 39,
    name: "Астраханская область",
    coordinates: [46.3497, 48.0408],
  },
  {
    id: 40,
    name: "Белгородская область",
    coordinates: [50.5977, 36.5858],
  },
  {
    id: 41,
    name: "Брянская область",
    coordinates: [53.2521, 34.3717],
  },
  {
    id: 42,
    name: "Владимирская область",
    coordinates: [56.1291, 40.4075],
  },
  {
    id: 43,
    name: "Волгоградская область",
    coordinates: [48.7194, 44.5018],
  },
  {
    id: 44,
    name: "Вологодская область",
    coordinates: [59.2239, 39.8839],
  },
  {
    id: 45,
    name: "Воронежская область",
    coordinates: [51.672, 39.1843],
  },
  {
    id: 46,
    name: "Запорожская область",
    coordinates: [47.8388, 35.1396],
  },
  {
    id: 47,
    name: "Ивановская область",
    coordinates: [57.005, 40.9737],
  },
  {
    id: 48,
    name: "Иркутская область",
    coordinates: [52.2978, 104.2967],
  },
  {
    id: 49,
    name: "Калининградская область",
    coordinates: [54.7074, 20.5073],
  },
  {
    id: 50,
    name: "Калужская область",
    coordinates: [54.5293, 36.2754],
  },
  {
    id: 51,
    name: "Кемеровская область",
    coordinates: [55.3333, 86.0833],
  },
  {
    id: 52,
    name: "Кировская область",
    coordinates: [58.5966, 49.6601],
  },
  {
    id: 53,
    name: "Костромская область",
    coordinates: [57.7665, 40.9269],
  },
  {
    id: 54,
    name: "Курганская область",
    coordinates: [55.4411, 65.3456],
  },
  {
    id: 55,
    name: "Курская область",
    coordinates: [51.7373, 36.1874],
  },
  {
    id: 56,
    name: "Ленинградская область",
    coordinates: [59.9343, 30.3351],
  },
  {
    id: 57,
    name: "Липецкая область",
    coordinates: [52.6031, 39.5708],
  },
  {
    id: 58,
    name: "Магаданская область",
    coordinates: [59.5681, 150.8085],
  },
  {
    id: 59,
    name: "Московская область",
    coordinates: [55.7558, 37.6173],
  },
  {
    id: 60,
    name: "Мурманская область",
    coordinates: [68.9585, 33.0827],
  },
  {
    id: 61,
    name: "Нижегородская область",
    coordinates: [56.2965, 43.9361],
  },
  {
    id: 62,
    name: "Новгородская область",
    coordinates: [58.5213, 31.2759],
  },
  {
    id: 63,
    name: "Новосибирская область",
    coordinates: [55.0415, 82.9346],
  },
  {
    id: 64,
    name: "Омская область",
    coordinates: [54.9885, 73.3242],
  },
  {
    id: 65,
    name: "Оренбургская область",
    coordinates: [51.7727, 55.0988],
  },
  {
    id: 66,
    name: "Орловская область",
    coordinates: [52.9685, 36.0692],
  },
  {
    id: 67,
    name: "Пензенская область",
    coordinates: [53.1959, 45.0288],
  },
  {
    id: 68,
    name: "Псковская область",
    coordinates: [57.8136, 28.3496],
  },
  {
    id: 69,
    name: "Ростовская область",
    coordinates: [47.2357, 39.7015],
  },
  {
    id: 70,
    name: "Рязанская область",
    coordinates: [54.6269, 39.6916],
  },
  {
    id: 71,
    name: "Самарская область",
    coordinates: [53.2001, 50.15],
  },
  {
    id: 72,
    name: "Саратовская область",
    coordinates: [51.5406, 46.0086],
  },
  {
    id: 73,
    name: "Сахалинская область",
    coordinates: [46.9641, 142.7285],
  },
  {
    id: 74,
    name: "Свердловская область",
    coordinates: [56.8519, 60.6122],
  },
  {
    id: 75,
    name: "Смоленская область",
    coordinates: [54.7818, 32.0401],
  },
  {
    id: 76,
    name: "Тамбовская область",
    coordinates: [52.7317, 41.4433],
  },
  {
    id: 77,
    name: "Тверская область",
    coordinates: [56.8587, 35.9176],
  },
  {
    id: 78,
    name: "Томская область",
    coordinates: [56.4847, 84.9481],
  },
  {
    id: 79,
    name: "Тульская область",
    coordinates: [54.1961, 37.6182],
  },
  {
    id: 80,
    name: "Тюменская область",
    coordinates: [57.1522, 65.5272],
  },
  {
    id: 81,
    name: "Ульяновская область",
    coordinates: [54.3181, 48.3832],
  },
  {
    id: 82,
    name: "Херсонская область",
    coordinates: [46.6354, 32.6169],
  },
  {
    id: 83,
    name: "Челябинская область",
    coordinates: [55.1644, 61.4368],
  },
  {
    id: 84,
    name: "Ярославская область",
    coordinates: [57.6299, 39.8737],
  },
  {
    id: 85,
    name: "Еврейская автономная область",
    coordinates: [48.7894, 132.9217],
  },
  {
    id: 86,
    name: "Ненецкий автономный округ",
    coordinates: [67.6381, 53.0069],
  },
  {
    id: 87,
    name: "Ханты-Мансийский автономный округ — Югра",
    coordinates: [61.0042, 69.0019],
  },
  {
    id: 88,
    name: "Чукотский автономный округ",
    coordinates: [64.7336, 177.5161],
  },
  {
    id: 89,
    name: "Ямало-Ненецкий автономный округ",
    coordinates: [66.5293, 66.6019],
  },
];

export type ILocation = {
  id: number;
  region: string;
  adress: {
    name: string;
    coordinates: [number, number];
  }[];
};

export const cityesLocations: ILocation[] = [
  {
    id: 1,
    region: "Адыгея Республика",
    adress: [
      {
        name: "Гиагинский Район 1",
        coordinates: [44.8667, 40.0667],
      },
      {
        name: "Кошехабльский Район",
        coordinates: [44.4167, 40.55],
      },
      {
        name: "Красногвардейский Район",
        coordinates: [45.1, 39.9833],
      },
      {
        name: "Майкопский Район",
        coordinates: [44.6078, 40.1058],
      },
      {
        name: "Тахтамукайский Район",
        coordinates: [44.9228, 38.9944],
      },
      {
        name: "Теучежский Район",
        coordinates: [44.9833, 39.65],
      },
      {
        name: "Шовгеновский Район",
        coordinates: [44.8333, 40.2833],
      },
      {
        name: "Адыгейск",
        coordinates: [44.8783, 39.1901],
      },
      {
        name: "Майкоп",
        coordinates: [44.6098, 40.1006],
      },
    ],
  },
  {
    id: 2,
    region: "Башкортостан Республика",
    adress: [
      {
        name: "Абзелиловский Район 2",
        coordinates: [53.4167, 58.5833],
      },
      {
        name: "Альшеевский Район",
        coordinates: [54.0, 54.8333],
      },
      {
        name: "Архангельский Район",
        coordinates: [54.4167, 56.8],
      },
      {
        name: "Аскинский Район",
        coordinates: [56.0833, 56.5833],
      },
      {
        name: "Аургазинский Район",
        coordinates: [54.0333, 56.0833],
      },
      {
        name: "Баймакский Район",
        coordinates: [52.5833, 58.3167],
      },
      {
        name: "Бакалинский Район",
        coordinates: [54.6333, 53.8],
      },
      {
        name: "Балтачевский Район",
        coordinates: [56.0, 55.3167],
      },
      {
        name: "Белебеевский Район",
        coordinates: [54.1167, 54.1167],
      },
      {
        name: "Белокатайский Район",
        coordinates: [55.9167, 58.9667],
      },
      {
        name: "Белорецкий Район",
        coordinates: [53.9667, 58.4],
      },
      {
        name: "Бижбулякский Район",
        coordinates: [53.7, 54.2833],
      },
      {
        name: "Бирский Район",
        coordinates: [55.4167, 55.5333],
      },
      {
        name: "Благоварский Район",
        coordinates: [54.3833, 54.8667],
      },
      {
        name: "Благовещенский Район",
        coordinates: [55.0333, 55.9833],
      },
      {
        name: "Буздякский Район",
        coordinates: [54.5833, 54.5833],
      },
      {
        name: "Бураевский Район",
        coordinates: [56.0833, 55.4167],
      },
      {
        name: "Бурзянский Район",
        coordinates: [53.45, 57.2333],
      },
      {
        name: "Гафурийский Район",
        coordinates: [53.5833, 56.3333],
      },
      {
        name: "Давлекановский Район",
        coordinates: [54.2167, 55.0333],
      },
      {
        name: "Дуванский Район",
        coordinates: [55.6953, 57.8953],
      },
      {
        name: "Дюртюлинский Район",
        coordinates: [55.4833, 54.8667],
      },
      {
        name: "Ермекеевский Район",
        coordinates: [54.0583, 53.675],
      },
      {
        name: "Зианчуринский Район",
        coordinates: [52.4833, 56.8],
      },
      {
        name: "Зилаирский Район",
        coordinates: [52.2333, 57.4333],
      },
      {
        name: "Иглинский Район",
        coordinates: [54.8167, 56.4],
      },
      {
        name: "Илишевский Район",
        coordinates: [55.9333, 54.4167],
      },
      {
        name: "Ишимбайский Район",
        coordinates: [53.45, 56.0333],
      },
      {
        name: "Калтасинский Район",
        coordinates: [56.0333, 54.8],
      },
      {
        name: "Караидельский Район",
        coordinates: [55.8333, 56.9],
      },
      {
        name: "Кармаскалинский Район",
        coordinates: [54.3667, 56.1667],
      },
      {
        name: "Кигинский Район",
        coordinates: [55.4167, 58.6],
      },
      {
        name: "Краснокамский Район",
        coordinates: [56.1167, 54.1833],
      },
      {
        name: "Кугарчинский Район",
        coordinates: [52.75, 56.4167],
      },
      {
        name: "Кушнаренковский Район",
        coordinates: [55.1, 55.3333],
      },
      {
        name: "Куюргазинский Район",
        coordinates: [52.75, 55.8],
      },
      {
        name: "Мелеузовский Район",
        coordinates: [52.9667, 55.9333],
      },
      {
        name: "Мечетлинский Район",
        coordinates: [55.95, 58.25],
      },
      {
        name: "Мишкинский Район",
        coordinates: [55.9333, 55.3333],
      },
      {
        name: "Миякинский Район",
        coordinates: [53.6333, 54.8167],
      },
      {
        name: "Нуримановский Район",
        coordinates: [55.2667, 56.8667],
      },
      {
        name: "Салаватский Район",
        coordinates: [55.0667, 58.2],
      },
      {
        name: "Стерлибашевский Район",
        coordinates: [53.4333, 55.2667],
      },
      {
        name: "Стерлитамакский Район",
        coordinates: [53.6333, 55.9333],
      },
      {
        name: "Татышлинский Район",
        coordinates: [56.2833, 55.85],
      },
      {
        name: "Туймазинский Район",
        coordinates: [54.6, 53.7],
      },
      {
        name: "Уфимский Район",
        coordinates: [54.75, 55.9667],
      },
      {
        name: "Учалинский Район",
        coordinates: [54.3167, 59.3833],
      },
      {
        name: "Федоровский Район",
        coordinates: [53.1667, 55.2],
      },
      {
        name: "Хайбуллинский Район",
        coordinates: [51.9833, 58.3167],
      },
      {
        name: "Чекмагушевский Район",
        coordinates: [55.1333, 54.6333],
      },
      {
        name: "Чишминский Район",
        coordinates: [54.5833, 55.3833],
      },
      {
        name: "Шаранский Район",
        coordinates: [54.8167, 54.1833],
      },
      {
        name: "Янаульский Район",
        coordinates: [56.2667, 54.9333],
      },
      {
        name: "Агидель",
        coordinates: [55.8997, 53.9332],
      },
      {
        name: "Кумертау",
        coordinates: [52.7565, 55.7967],
      },
      {
        name: "Межгорье",
        coordinates: [54.2397, 57.96],
      },
      {
        name: "Нефтекамск",
        coordinates: [56.0883, 54.2483],
      },
      {
        name: "Октябрьский",
        coordinates: [54.4815, 53.4656],
      },
      {
        name: "Салават",
        coordinates: [53.3616, 55.9245],
      },
      {
        name: "Сибай",
        coordinates: [52.7183, 58.6663],
      },
      {
        name: "Стерлитамак",
        coordinates: [53.6333, 55.9333],
      },
      {
        name: "Уфа",
        coordinates: [54.7349, 55.9578],
      },
    ],
  },
];
